def caching_fibonacci(): # Створюємо функцію
    cache = {}  # Створюємо порожній словник для зберігання результатів обчислення чисел Фібоначчі

    def fibonacci(n): # Створюємо внутрішню функцію для обчислень
        if n <= 0:      # Задаємо умову
            return 0  # Повертає 0 для n <= 0
        elif n == 1:    # Задаємо умову
            return 1  # Повертає 1 для n == 1
        if n in cache:
            return cache[n]  # Повертає з кешу, якщо значення вже є
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)  # Обчислює і зберігає у кеш
        return cache[n]  # Повертає збережене значення

    return fibonacci  # Повертає функцію fibonacci

# Приклад використання
fib = caching_fibonacci()
print(fib(15))  # Виведе 620 (15-е число Фібоначчі)
print(fib(25))  # Виведе 75025 (25-е число Фібоначчі)
