import re

def generator_numbers(text): # Створюємо функцію, яка буде аналізувати текст, ідентифікувати всі дійсні числа, що вважаються частинами доходів та повертати їх як генератор
    # Використовуємо регулярний вираз для пошуку дійсних чисел, відокремлених пробілами
    pattern = re.compile(r'\b\d+\.\d+\b')
    matches = pattern.findall(text)
    
    for match in matches:
        yield float(match)  # Використовуємо yield для повернення кожного знайденого числа як генератор

def sum_profit(text, func): # Створюємо функцію, що підсумовує всі числа у тексті за допомогою генератора
    return sum(func(text))  # Використовуємо sum для підсумовування чисел, які повертає генератор

# Приклад використання
text = "Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів."

total_income = sum_profit(text, generator_numbers)
print(f"Загальний дохід: {total_income}")  # Очікуване виведення: Загальний дохід: 1351.46
